ErpTest/src/Catalogs/пкПользователиМП/пкПользователиМП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>пкПользователиМП</name>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторПользователяИБ</name>
    <comment>Требуется для сопоставления элемента справочника Пользователи пользователю ИБ</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерТелефона</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>БизнесРегион</name>
    <type>
      <types>CatalogRef.БизнесРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыАрендаТехники</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСервис</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыЛогистика</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыСогласованиеЗаявок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоступностьПодсистемыПеревозки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПраваЛогиста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КогоЗамещает</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Catalog>

ErpTest/src/Catalogs/пкПользователиМП/Forms/ФормаЭлемента/Module.bsl
&НаКлиенте
Процедура ПодборКонтрагентов(Команда)
	Оповещение = Новый ОписаниеОповещения("ПодборКонтрагентовЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.ОС_ПользователиМП.Форма.ФормаПодбораКонтрагентов",Новый Структура("МножественныйВыбор",Истина),ЭтаФорма,,,,Оповещение);	
КонецПроцедуры

&НаКлиенте
Процедура ПодборКонтрагентовЗавершение (Результат, ДополнительныеПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;	
	Для Каждого Эл Из Результат Цикл
		Если Объект.рсДоступныеКонтрагенты.НайтиСтроки(Новый Структура("Контрагент",Эл)).Количество() = 0 Тогда
			НоваяСтрока            = Объект.рсДоступныеКонтрагенты.Добавить();
			НоваяСтрока.Контрагент = ЭЛ;
			Модифицированность     = Истина;
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для Каждого Эл Из Метаданные.Языки Цикл
		Элементы.Язык.СписокВыбора.Добавить(Эл.Имя,Эл.Синоним);
	КонецЦикла;	
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимость ()
	//Элементы.ПользовательДО.Видимость = Объект.ДоступностьПодсистемыСогласованиеЗаявок;
	//Элементы.ПарольДО.Видимость       = Объект.ДоступностьПодсистемыСогласованиеЗаявок;
	Элементы.ПраваЛогиста.Доступность = Объект.ДоступностьПодсистемыПеревозки;
	Элементы.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера.Доступность = Объект.ДоступностьПодсистемыАрендаТехники;
	Элементы.КогоЗамещает.Доступность = Объект.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера;
КонецПроцедуры	

&НаКлиенте
Процедура ДоступностьПодсистемыСогласованиеЗаявокПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПодсистемыПеревозкиПриИзменении(Элемент)
	Если НЕ Объект.ДоступностьПодсистемыПеревозки Тогда
		Объект.ПраваЛогиста = Ложь;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьПодсистемыПродажиПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура ЗаведениеЗаявокНаАрендуЗаДругогоМенеджераПриИзменении(Элемент)
	Если Не Объект.ЗаведениеЗаявокНаАрендуЗаДругогоМенеджера Тогда
		Объект.КогоЗамещает = Неопределено;
	КонецЕсли;	
	УстановитьВидимость();
КонецПроцедуры
